Topic : Pandas (python) Tips and Tricks\
Written by : Abdul Rehman\
Date: 27.08.2025\
Email: oyeeemani47@gmail.com

# Contents
[1- how to find the version](#01--how-to-find-the-version)\
[2- make a dataframe](#02--make-a-dataframe)\
[4- using template data](#4--using-template-data)\
[5- using your own data](#5--using-your-own-data)\
[adding prefix to column](#adding-prefix-to-column)\
[adding suffix to column](#adding-suffix-to-column)\
[how to rename column](#how-to-rename-columns)\
[to replace any character and string](#to-replace-any-character-and-string)

# 01- How to find the version

In [3]:
import pandas as pd
pd.__version__

'2.3.2'

In [6]:
# Another way of checking version
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : 4665c10899bc413b639194f6fb8665a5c70f7db5
python                : 3.13.5
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.19045
machine               : AMD64
processor             : Intel64 Family 6 Model 58 Stepping 9, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_United Kingdom.1252

pandas                : 2.3.2
numpy                 : 2.3.2
pytz                  : 2025.2
dateutil              : 2.9.0.post0
pip                   : 25.1.1
Cython                : None
sphinx                : None
IPython               : 9.4.0
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : None
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : None
lxml.etree            : None
matplotlib            : 3.10.5
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.5
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : None
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : None
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
xlsxwriter            : None
zstandard             : None
tzdata                : 2025.2
qtpy                  : None
pyqt5                 : None

# 02- Make a dataframe

In [11]:
pd.DataFrame({'A col':[1,2,3,5,4,3,2,3,4],'B col':[4,5,6,1,2,3,2,2,2],})
df = pd.DataFrame({'A col':[1,2,3,5,4,3,2,3,4],'B col':[4,5,6,1,2,3,2,2,2],})

df

   A col  B col
0      1      4
1      2      5
2      3      6
3      5      1
4      4      2
5      3      3
6      2      2
7      3      2
8      4      2

In [13]:
df.head(3)

   A col  B col
0      1      4
1      2      5
2      3      6

In [14]:
df.shape

(9, 2)

> Numpy array to create dataframe

In [16]:
import numpy as np
arr = np.array([[1,2,3],[4,5,6],[7,8,9],])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [18]:
pd.DataFrame(arr)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
# numpy array dataframe
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.704466,0.549785,0.124032,0.463180,0.686883,0.006280,0.318112,0.459921
1,0.852778,0.681198,0.277576,0.439151,0.211989,0.444650,0.714315,0.537629
2,0.095988,0.060246,0.287902,0.508290,0.159162,0.028794,0.238530,0.493086
3,0.197253,0.215227,0.920093,0.022947,0.291085,0.621822,0.424424,0.084644

In [21]:
pd.DataFrame(np.random.rand(4,8), columns= list("ABCDEFGH"))

,A,B,C,D,E,F,G,H
0,0.609631,0.957323,0.074283,0.481957,0.602420,0.058187,0.105278,0.180965
1,0.925397,0.878031,0.060095,0.276043,0.749662,0.510850,0.803396,0.491928
2,0.299501,0.795058,0.066429,0.759878,0.911695,0.738668,0.943781,0.741981
3,0.507279,0.865190,0.155720,0.649841,0.511068,0.070755,0.782272,0.428308

# How to rename columns?

In [22]:
df = pd.DataFrame({'A col':[1,2,3,5,4,3,2,3,4],'B col':[4,5,6,1,2,3,2,2,2],})
df

   A col  B col
0      1      4
1      2      5
2      3      6
3      5      1
4      4      2
5      3      3
6      2      2
7      3      2
8      4      2

In [27]:
df.rename(columns={'A col': 'col_a','B col':'col_b'},inplace=True)
df

   col_a  col_b
0      1      4
1      2      5
2      3      6
3      5      1
4      4      2
5      3      3
6      2      2
7      3      2
8      4      2

> Another way of renaming

In [30]:
df.columns=['col_aa','col_bb']
df

   col_aa  col_bb
0       1       4
1       2       5
2       3       6
3       5       1
4       4       2
5       3       3
6       2       2
7       3       2
8       4       2

# To replace any character and string

In [31]:
df.columns=df.columns.str.replace('l','ll')
df

   coll_aa  coll_bb
0        1        4
1        2        5
2        3        6
3        5        1
4        4        2
5        3        3
6        2        2
7        3        2
8        4        2

In [32]:
df.columns=df.columns.str.replace('b','bb')
df

   coll_aa  coll_bbbb
0        1          4
1        2          5
2        3          6
3        5          1
4        4          2
5        3          3
6        2          2
7        3          2
8        4          2

# Adding prefix to column

In [ ]:
df = df.add_prefix('baba_')
df

   babababa_baba_coll_aa  babababa_baba_coll_bbbb
0                      1                        4
1                      2                        5
2                      3                        6
3                      5                        1
4                      4                        2
5                      3                        3
6                      2                        2
7                      3                        2
8                      4                        2

# Adding suffix to column

In [37]:
df = df.add_suffix('_baba')
df

   babababa_baba_coll_aa_baba  babababa_baba_coll_bbbb_baba
0                           1                             4
1                           2                             5
2                           3                             6
3                           5                             1
4                           4                             2
5                           3                             3
6                           2                             2
7                           3                             2
8                           4                             2

In [39]:
df.columns=['col_a','col_b']
df

   col_a  col_b
0      1      4
1      2      5
2      3      6
3      5      1
4      4      2
5      3      3
6      2      2
7      3      2
8      4      2

# 4- Using Template Data

In [41]:
import pandas as pd
import numpy as np
import seaborn as sns


df=sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
# Summary
df.describe()
# Column name
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

> Saving a dataset

In [45]:
#Saving a dataset
df.to_csv('tips_save.csv')
df.to_excel('tips_save.xlsx')

# 5- Using your own data

In [ ]:
import pandas as pd

# df= pd.read_csv('tips_save.csv')
# df.head()
# df = pd.read_excel('tips_save.xlsx')
# df.head()

   Unnamed: 0  total_bill   tip     sex smoker  day    time  size
0           0       16.99  1.01  Female     No  Sun  Dinner     2
1           1       10.34  1.66    Male     No  Sun  Dinner     3
2           2       21.01  3.50    Male     No  Sun  Dinner     3
3           3       23.68  3.31    Male     No  Sun  Dinner     2
4           4       24.59  3.61  Female     No  Sun  Dinner     4